
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.ams_function_app.module.storage_account.azapi_update_resource.defender_settings
  * module.ams_function_app.module.storage_account.azurerm_storage_account.storage_account
  * module.ams_function_app.module.storage_account.random_string.storage_account_random_string
  * module.ams_function_app.module.storage_account.time_rotating.rotate
  * module.ams_function_app.module.storage_account.time_static.pim_expiry
  * module.ams_function_app.module.storage_account.time_static.pim_start
* Update
  * module.ams_function_app.azurerm_linux_function_app.this[0]
* Delete
  * module.ams_function_app.azurerm_storage_account.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ams_function_app.azurerm_linux_function_app.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Web/sites/pre-ams-integration-prod"
        name                              = "pre-ams-integration-prod"
      ~ storage_account_access_key        = (sensitive value)
      ~ tags                              = {
            "application"                                    = "pre-recorded-evidence"
            "builtFrom"                                      = "https://github.com/HMCTS/pre-functions.git"
            "businessArea"                                   = "Cross-Cutting"
            "contactSlackChannel"                            = "#dts-pre-rec-evidence-tech"
            "environment"                                    = "production"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=bc325156-873d-4299-9508-c3119c5ab82f;IngestionEndpoint=https://uksouth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=ab04a40c-8ee1-49b3-91fb-dab038d7dfd1" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "bc325156-873d-4299-9508-c3119c5ab82f" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/microsoft.insights/components/pre-pre-ams-integration-prod" -> null
            "managedBy"                                      = "Pre Recorded Evidence"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          ~ application_insights_connection_string  = (sensitive value)
          - application_insights_key                = (sensitive value) -> null
            # (23 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - sticky_settings {
          - app_setting_names       = [
              - "APPINSIGHTS_INSTRUMENTATIONKEY",
              - "APPLICATIONINSIGHTS_CONNECTION_STRING ",
              - "APPINSIGHTS_PROFILERFEATURE_VERSION",
              - "APPINSIGHTS_SNAPSHOTFEATURE_VERSION",
              - "ApplicationInsightsAgent_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_BaseExtensions",
              - "DiagnosticServices_EXTENSION_VERSION",
              - "InstrumentationEngine_EXTENSION_VERSION",
              - "SnapshotDebugger_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_Mode",
              - "XDT_MicrosoftApplicationInsights_PreemptSdk",
              - "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT",
              - "XDT_MicrosoftApplicationInsightsJava",
              - "XDT_MicrosoftApplicationInsights_NodeJS",
            ] -> null
          - connection_string_names = [] -> null
        }

        # (1 unchanged block hidden)
    }

  # module.ams_function_app.azurerm_storage_account.this will be destroyed
  # (because azurerm_storage_account.this is not in configuration)
  - resource "azurerm_storage_account" "this" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preamsintegrationprod" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "preamsintegrationprod" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://preamsintegrationprod.blob.core.windows.net/" -> null
      - primary_blob_host                 = "preamsintegrationprod.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://preamsintegrationprod.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "preamsintegrationprod.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://preamsintegrationprod.file.core.windows.net/" -> null
      - primary_file_host                 = "preamsintegrationprod.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://preamsintegrationprod.queue.core.windows.net/" -> null
      - primary_queue_host                = "preamsintegrationprod.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://preamsintegrationprod.table.core.windows.net/" -> null
      - primary_table_host                = "preamsintegrationprod.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://preamsintegrationprod.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "preamsintegrationprod.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "pre-prod" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"         = "pre-recorded-evidence"
          - "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "production"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.ams_function_app.module.storage_account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.ams_function_app.module.storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "preamsintegrationprod"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-prod"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "production"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.ams_function_app.module.storage_account.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ams_function_app.module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.ams_function_app.module.storage_account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.ams_function_app.module.storage_account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 6 to add, 1 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ams_function_app.module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/components/pre-pre-ams-integration-prod"
        name                                  = "pre-pre-ams-integration-prod"
        tags                                  = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->